Tekla Open API Reference for Tekla Structures 2025
StructuresDialogAttribute Constructor
Overload List
Name | Description
StructuresDialogAttribute(String)
 Initializes a new StructuresDialogAttribute instance.
StructuresDialogAttribute(String, String)
 Initializes a new StructuresDialogAttribute instance.
StructuresDialogAttribute(String, Type)
 Initializes a new StructuresDialogAttribute instance.
Top
See Also
Reference
StructuresDialogAttribute Class
Tekla.Structures.Dialog Namespace